# ClearAll Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySizes..::..ClearAll Method
CableTraySizes Class See Also
---
Removes all MEPSizes in the cable tray sizes.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void ClearAll()
```

Visual Basic
---
```text
Public Sub ClearAll
```

Visual C++
---
```text
public:
void ClearAll()
```

# See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace